Revit 2027 API
TableSectionData.GetMergedCell Method
 Gets the whole merged cell that this cell is a part of.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableMergedCell GetMergedCell(
	int nRow,
	int nCol
)
Public Function GetMergedCell (
	nRow As Integer,
	nCol As Integer
) As TableMergedCell
public:
TableMergedCell^ GetMergedCell(
	int nRow,
	int nCol
)
member GetMergedCell :
        nRow : int *
        nCol : int -> TableMergedCell
Parameters
nRow Int32
 The cell row.
nCol Int32
 The cell column.
Return Value
TableMergedCell
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace